COOP-5/Designing-Data-Intensive-Applications/02-Data-Models-and-Query-Languages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 00:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Models and Query Languages</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Data Models and Query Languages</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org33a25b2">1. Introduction</a></li>
<li><a href="#orga3420a3">2. Relational Model vs Document Model</a>
<ul>
<li><a href="#org6225ef2">2.1. Birth of NoSQL</a></li>
<li><a href="#orgca6b498">2.2. Object-Relational Mismatch</a></li>
<li><a href="#org6bba627">2.3. Many-to-One and Many-to-Many Relationships</a></li>
<li><a href="#org8b7eb97">2.4. Are Document Databases Repeating History?</a>
<ul>
<li><a href="#org459528f">2.4.1. Network Model</a></li>
<li><a href="#org6936547">2.4.2. Relational Model</a></li>
<li><a href="#org8d2e033">2.4.3. Comparison to Document Databases</a></li>
</ul>
</li>
<li><a href="#orgcc7ad52">2.5. Relational vs Document Databases Today</a>
<ul>
<li><a href="#org15d4486">2.5.1. Simpler Application Code</a></li>
<li><a href="#orga1a4b4f">2.5.2. Schema Flexibility</a></li>
<li><a href="#orgf5a02c8">2.5.3. Data Locality</a></li>
<li><a href="#org499d58f">2.5.4. Convergence of Document and Relational DBs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6cdb9e2">3. Query Languages for Data</a>
<ul>
<li><a href="#orgc669c65">3.1. Declarative Queries on the Web</a></li>
<li><a href="#org25db9d2">3.2. MapReduce Querying</a></li>
</ul>
</li>
<li><a href="#org4af304e">4. Graph-Like Data Models</a>
<ul>
<li><a href="#orgb3b26cf">4.1. Property Graphs</a></li>
<li><a href="#org2ed89de">4.2. The Cypher Query Language</a></li>
<li><a href="#org62149b5">4.3. Graph Queries in SQL</a></li>
<li><a href="#org57ca92e">4.4. Triple-Stores and SPARQL</a>
<ul>
<li><a href="#org3cb9a41">4.4.1. Semantic Web</a></li>
<li><a href="#org7082cab">4.4.2. RDF Data Model</a></li>
<li><a href="#orgd17ce7c">4.4.3. SPARQL Query Language</a></li>
</ul>
</li>
<li><a href="#orga8d3577">4.5. The Foundation: Datalog</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org33a25b2" class="outline-2">
<h2 id="org33a25b2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Most applications are built by layering data models, each layer hiding the
complexity of the layers below.
</p>

<p>
Every data model embodies assumptions about how it will be used.
</p>
</div>
</div>
<div id="outline-container-orga3420a3" class="outline-2">
<h2 id="orga3420a3"><span class="section-number-2">2.</span> Relational Model vs Document Model</h2>
<div class="outline-text-2" id="text-2">
<p>
Data organized into <b>relations</b>, which are unordered collections of <b>tuples</b>.
</p>

<p>
Hides implementation detail behind a clean interface.
</p>
</div>
<div id="outline-container-org6225ef2" class="outline-3">
<h3 id="org6225ef2"><span class="section-number-3">2.1.</span> Birth of NoSQL</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Refers to <i>Not Only SQL</i>.
</p>

<p>
NoSQL is adopted due to:
</p>
<ul class="org-ul">
<li>need for greater scalability than relational DBs</li>
<li>preference for FOSS over commercial DBs</li>
<li>specialized query operations not well supported by relational model</li>
<li>frustration with restriction of relational schemas</li>
</ul>
</div>
</div>
<div id="outline-container-orgca6b498" class="outline-3">
<h3 id="orgca6b498"><span class="section-number-3">2.2.</span> Object-Relational Mismatch</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Impedance mismatch</b>: disconnect between object-oriented model of application
code and relational model of DB
</p>

<p>
ORM frameworks help hide mismatch.
</p>

<p>
JSON can reduce impedance mismatch, with better locality (all relevant info
in one place).
This is the <b>document</b> model.
</p>
</div>
</div>
<div id="outline-container-org6bba627" class="outline-3">
<h3 id="org6bba627"><span class="section-number-3">2.3.</span> Many-to-One and Many-to-Many Relationships</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Using standardized lists rather than strings can enforce consistent spelling,
avoid ambiguity, make updates easier, localize support, and allow for better
search.
</p>

<p>
Using strings causes duplication.
Removing duplication is the idea behind DB <b>normalization</b>.
This is easier to do with the relational model than the document model.
</p>
</div>
</div>
<div id="outline-container-org8b7eb97" class="outline-3">
<h3 id="org8b7eb97"><span class="section-number-3">2.4.</span> Are Document Databases Repeating History?</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org459528f" class="outline-4">
<h4 id="org459528f"><span class="section-number-4">2.4.1.</span> Network Model</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Generalization of the hierarchical model where:
</p>
<ul class="org-ul">
<li>each record can have multiple parents</li>
<li>links between records are not foreign keys but instead
pointers that can be followed through an <b>access path</b>
<ul class="org-ul">
<li>can have multiple paths to the same record</li>
</ul></li>
</ul>

<p>
Can change access paths, but then must rewrite code to handle
new access paths.
Difficult to change application&rsquo;s data model.
</p>
</div>
</div>
<div id="outline-container-org6936547" class="outline-4">
<h4 id="org6936547"><span class="section-number-4">2.4.2.</span> Relational Model</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Simpler since no nested structure.
</p>

<p>
Query optimizer decides which parts of query to execute in which
order, and which indexes are used.
</p>
</div>
</div>
<div id="outline-container-org8d2e033" class="outline-4">
<h4 id="org8d2e033"><span class="section-number-4">2.4.3.</span> Comparison to Document Databases</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Document DBs are similar to hierarchical DBs, except for many-to-one
and many-to-many relationships where they are like relational DBs.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcc7ad52" class="outline-3">
<h3 id="orgcc7ad52"><span class="section-number-3">2.5.</span> Relational vs Document Databases Today</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Document data model benefits:
</p>
<ul class="org-ul">
<li>schema flexibility</li>
<li>better performance due to locality</li>
<li>closer to data structures used by the application</li>
</ul>

<p>
Relational data model benefits:
</p>
<ul class="org-ul">
<li>better support for joins, many-to-one, and many-to-many
relationships</li>
</ul>
</div>
<div id="outline-container-org15d4486" class="outline-4">
<h4 id="org15d4486"><span class="section-number-4">2.5.1.</span> Simpler Application Code</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
If data is a tree of one-to-many relationships, document
model is better.
</p>

<p>
If application uses many-to-many relationships, relational mode
is better.
</p>
</div>
</div>
<div id="outline-container-orga1a4b4f" class="outline-4">
<h4 id="orga1a4b4f"><span class="section-number-4">2.5.2.</span> Schema Flexibility</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Document DBs do not enforce any schema on the data in documents.
</p>

<p>
Document DBs have <b>schema-on-read</b> (structure interpreted when data
is read).
</p>

<p>
Relational DBs have <b>schema-on-write</b> (DB ensures all written data
conforms to schema).
</p>

<p>
Schema-on-read can be helpful if items in the collection don&rsquo;t all have
the same structure.
</p>
</div>
</div>
<div id="outline-container-orgf5a02c8" class="outline-4">
<h4 id="orgf5a02c8"><span class="section-number-4">2.5.3.</span> Data Locality</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
Documents are usually stored as a string, providing <b>storage locality</b>.
</p>

<p>
Locality helps if large parts of document are needed at once.
</p>

<p>
Writes replace the entire document.
</p>

<p>
Some relational DBs allow for locality.
</p>
</div>
</div>
<div id="outline-container-org499d58f" class="outline-4">
<h4 id="org499d58f"><span class="section-number-4">2.5.4.</span> Convergence of Document and Relational DBs</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
Most relational DBs support XML, and some support JSON.
</p>

<p>
Some document DBs support relational-like joins.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6cdb9e2" class="outline-2">
<h2 id="org6cdb9e2"><span class="section-number-2">3.</span> Query Languages for Data</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Imperative</b> languages specify operations to perform.
</p>

<p>
<b>Declarative</b> languages specify only the pattern of the data
you want.
</p>

<p>
Declarative languages allow any implementations and lend
themselves to parallel execution.
</p>
</div>
<div id="outline-container-orgc669c65" class="outline-3">
<h3 id="orgc669c65"><span class="section-number-3">3.1.</span> Declarative Queries on the Web</h3>
<div class="outline-text-3" id="text-3-1">
<p>
HTML and CSS are declarative languages used on the web.
</p>
</div>
</div>
<div id="outline-container-org25db9d2" class="outline-3">
<h3 id="org25db9d2"><span class="section-number-3">3.2.</span> MapReduce Querying</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Programming model for processing large amounts of data in
bulk across machines.
</p>

<p>
Neither fully declarative or imperative.
</p>

<p>
Steps in MapReduce:
</p>
<ol class="org-ol">
<li>Filter is specified declaratively.</li>
<li><code>map</code> is called once for every document that matches
the query, where <code>this</code> is the document object</li>
<li><code>map</code> emits a key and a value</li>
<li>Key-value pairs emitted by <code>map</code> are grouped by the key,
and for all key-value pairs with the same key, <code>reduce</code>
is called once</li>
<li><code>reduce</code> adds up the number of animals from all observations
in a particular month</li>
<li>Final output is written to collection specified.</li>
</ol>

<p>
<code>map</code> and <code>reduce</code> only use the data passed as input, cannot
perform additional DB queries, and cannot have any side effects.
</p>
</div>
</div>
</div>
<div id="outline-container-org4af304e" class="outline-2">
<h2 id="org4af304e"><span class="section-number-2">4.</span> Graph-Like Data Models</h2>
<div class="outline-text-2" id="text-4">
<p>
Graphs can be used as a data model, especially for many-to-many
relations.
</p>
</div>
<div id="outline-container-orgb3b26cf" class="outline-3">
<h3 id="orgb3b26cf"><span class="section-number-3">4.1.</span> Property Graphs</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Each vertex consists of:
</p>
<ul class="org-ul">
<li>unique identifier</li>
<li>set of outgoing edges</li>
<li>set of incoming edges</li>
<li>collection of properties (key-value pairs)</li>
</ul>

<p>
Each edge consists of:
</p>
<ul class="org-ul">
<li>unique identifier</li>
<li><b>tail vertex</b>: vertex at which edge starts</li>
<li><b>head vertex</b>: vertex at which edge ends</li>
<li>label to describe relationship between two vertices</li>
<li>collection of properties (key-value pairs)</li>
</ul>

<p>
Any vertex can have an edge connecting it with any other
vertex. No schema restricts which kinds of things can or cannot
be associated.
</p>

<p>
Given any vertex, can traverse the graph through incoming and
outgoing edges.
</p>

<p>
By using different labels for different kinds of relationships,
store several kinds of info in a single graph while still
maintaining a clean data model.
</p>

<p>
Graphs are good for evolvability: as features are added to an
application, a graph can easily be extended to accommodate
changes in the application&rsquo;s data structures.
</p>
</div>
</div>
<div id="outline-container-org2ed89de" class="outline-3">
<h3 id="org2ed89de"><span class="section-number-3">4.2.</span> The Cypher Query Language</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Declarative query language for property graphs.
</p>

<p>
Query optimizer automatically chooses most efficient strategy.
</p>
</div>
</div>
<div id="outline-container-org62149b5" class="outline-3">
<h3 id="org62149b5"><span class="section-number-3">4.3.</span> Graph Queries in SQL</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Graph data in a relational structure can be queried with SQL,
though with some difficulty.
</p>

<p>
Variable-length traversal paths in a query can be expressed
using <b>recursive common table expressions</b>.
</p>
</div>
</div>
<div id="outline-container-org57ca92e" class="outline-3">
<h3 id="org57ca92e"><span class="section-number-3">4.4.</span> Triple-Stores and SPARQL</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In a <b>triple-store</b>, all info is stored in the form of simple
3-part statements: (subject, predicate, object).
</p>

<p>
Subject of the triple is a vertex.
Object can be a value or a vertex.
Predicate is an edge.
</p>
</div>
<div id="outline-container-org3cb9a41" class="outline-4">
<h4 id="org3cb9a41"><span class="section-number-4">4.4.1.</span> Semantic Web</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Idea that websites should publish info as machine-readable
data for computers to read.
</p>
</div>
</div>
<div id="outline-container-org7082cab" class="outline-4">
<h4 id="org7082cab"><span class="section-number-4">4.4.2.</span> RDF Data Model</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Used for internet-wide data exchange.
</p>

<p>
Subject, object, and predicate are URIs.
</p>
</div>
</div>
<div id="outline-container-orgd17ce7c" class="outline-4">
<h4 id="orgd17ce7c"><span class="section-number-4">4.4.3.</span> SPARQL Query Language</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
Query language for triple-stores using RDF data model.
</p>
</div>
</div>
</div>
<div id="outline-container-orga8d3577" class="outline-3">
<h3 id="orga8d3577"><span class="section-number-3">4.5.</span> The Foundation: Datalog</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Older language used in few data systems.
</p>

<p>
Define rules that tell that DB about new predicates.
</p>

<p>
Predicates aren&rsquo;t triples stored in the DB, but are
derived from data or rules.
</p>

<p>
A rule applies if the system can find a match for all
predicates on the right hand side of the <code>:-</code> operator.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2025-01-17 Fri 00:16</p>
</div>
</body>
</html>
